Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter
The Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter class provides a translation from any Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic
to a matching Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all the individual Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphic instances to be drawn.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.Decompose(Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic)
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
graphicPrimitive: The Tekla.BIM.DirectManipulation.Services.Graphics.PrimitiveGraphic to decompose.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for graphicPrimitive.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.DecomposeArcGraphic(Tekla.BIM.DirectManipulation.Services.Graphics.ArcGraphic)
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.ArcGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
arcGraphic: The Tekla.BIM.DirectManipulation.Services.Graphics.ArcGraphic to decompose.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for arcGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.DecomposeCircleGraphic(Tekla.BIM.DirectManipulation.Services.Graphics.CircleGraphic)
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.CircleGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
circleGraphic: The Tekla.BIM.DirectManipulation.Services.Graphics.CircleGraphic to decompose.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for circleGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.DecomposeLineGraphic(Tekla.BIM.DirectManipulation.Services.Graphics.LineGraphic)
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.LineGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
lineGraphic: The Tekla.BIM.DirectManipulation.Services.Graphics.LineGraphic to decompose.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for lineGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.DecomposeFaceGraphic(Tekla.BIM.DirectManipulation.Services.Graphics.FaceGraphic)
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.FaceGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
faceGraphic: The Tekla.BIM.DirectManipulation.Services.Graphics.FaceGraphic to decompose.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for faceGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.DecomposeTextGraphic(Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic,System.Nullable{Tekla.BIM.DirectManipulation.Services.Interaction.InteractionState})
Decomposes the given Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic to a Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection.
textGraphic: The Tekla.BIM.DirectManipulation.Services.Graphics.TextGraphic to decompose.
state: The interaction state.
Returns: A Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsCollection containing all primitives that are expected to be drawn for textGraphic.

Tekla.Structures.DirectManipulation.Adapter.Graphics.NativeGraphicsConverter.AssertArgumentNotNull``1(``0,System.String)
Asserts that the given value is not null.
Throws System.ArgumentNullException:
Thrown when value is null.
The type of value.
value: The value to assert.
paramName: The System.String value to forward to the System.ArgumentNullException.